
def area(a):
    """
        Вычисляет площадь квадрата по длине его стороны.

        Параметры:
        a (float): Длина стороны квадрата. Должна быть положительным числом.

        Возвращает:
        float: Площадь квадрата.

        Пример вызова:
        >>> area(5)
        25.0
        """

    return a * a


def perimeter(a):
    """
        Вычисляет периметр квадрата по длине его стороны.

        Параметры:
        a (float): Длина стороны квадрата. Должна быть положительным числом.

        Возвращает:
        float: Периметр квадрата.

        Пример вызова:
        >>> perimeter(5)
        20.0
        """
    
    return 4 * a
